; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	thermograph0 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	Star5 - direction
	Star7 - direction
	GroundStation8 - direction
	Star6 - direction
	GroundStation3 - direction
	Star2 - direction
	Star9 - direction
	GroundStation0 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star9)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star9)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
)
(:goal (and
	(pointing satellite0 Phenomenon11)
	(pointing satellite3 GroundStation8)
	(have_image Star10 thermograph0)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image1)
))

)

; plan
1. (turn_to satellite3 groundstation8 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 groundstation8)
   goals met: 2 of 5
2. (turn_to satellite1 star2 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star2)
   goals met: 2 of 5
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 5
4. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 2 of 5
5. (turn_to satellite1 phenomenon11 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 5
6. (take_image satellite1 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 3 of 5
7. (turn_to satellite1 phenomenon12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 5
8. (take_image satellite1 phenomenon12 instrument1 image1)
   added: (have_image phenomenon12 image1)
   goals met: 4 of 5
9. (turn_to satellite1 star10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star10)
   goals met: 4 of 5
10. (take_image satellite1 star10 instrument1 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 5 of 5
